for i in (1...100) {
    if (i % 3 == 0) {
        print("3의 배수 발견: \(i)")
    }
}

/*
 3의 배수 발견: 3
 3의 배수 발견: 6
 3의 배수 발견: 9
 3의 배수 발견: 12
 3의 배수 발견: 15
 3의 배수 발견: 18
 3의 배수 발견: 21
 3의 배수 발견: 24
 3의 배수 발견: 27
 3의 배수 발견: 30
 3의 배수 발견: 33
 3의 배수 발견: 36
 3의 배수 발견: 39
 3의 배수 발견: 42
 3의 배수 발견: 45
 3의 배수 발견: 48
 3의 배수 발견: 51
 3의 배수 발견: 54
 3의 배수 발견: 57
 3의 배수 발견: 60
 3의 배수 발견: 63
 3의 배수 발견: 66
 3의 배수 발견: 69
 3의 배수 발견: 72
 3의 배수 발견: 75
 3의 배수 발견: 78
 3의 배수 발견: 81
 3의 배수 발견: 84
 3의 배수 발견: 87
 3의 배수 발견: 90
 3의 배수 발견: 93
 3의 배수 발견: 96
 3의 배수 발견: 99

 */
